src/slides/03-python-minimo.org
#+TITLE: Python Mínimo
#+AUTHOR: Lucas S. Vieira
#+SUBTITLE: O essencial para começar com IA
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js@4/
#+REVEAL_THEME: night
#+REVEAL_PLUGINS: (highlight)
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.0
#+OPTIONS: toc:nil num:nil
#+REVEAL_TITLE_SLIDE: <p style="font-size:0.7em;opacity:0.6;">%a</p><br/><h2>%t</h2><br/><p style="font-size:0.85em;opacity:0.8;">%s</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
#+REVEAL_TITLE_SLIDE_BACKGROUND: ./slide_03.gif

* 📰 Fofocas da Semana

#+ATTR_HTML: :style font-size:0.6em;text-align:left;
- *GPT-5.5 Instant* (8/mai) → novo modelo default do ChatGPT, 52% menos alucinação
- *ZAYA1-8B* (7/mai) → MoE de 760M params ativos que bate modelos 30x maiores em math/coding
- *Claude Sonnet 4.8 vazado* → source do Claude Code expôs 512K linhas e road map interno
- *Mythos vs GPT-5.5 Cyber* → AISI testou: GPT-5.5 fez 71.4%, Mythos 68.6% em cyber — empate técnico
- *Mistral Medium 3.5* → 128B params, 256K contexto, 77.6% SWE-bench, Apache 2.0

* Fofoca: ZAYA1-8B

#+ATTR_HTML: :style font-size:0.6em;text-align:left;
#+begin_quote
8.4B total, 760M ativos por token (MoE++).
Apache 2.0. Treinado em AMD MI300x (1024 nós).

Mas: arquitetura customizada (CCA + router MLP) → *não roda em llama.cpp*. Precisa de vLLM/SGLang.
#+end_quote

#+ATTR_HTML: :style font-size:0.6em;text-align:left;
#+begin_quote
Daniel Lougen (M.S.): "ZAYA1-8B usa até *5.5M tokens por problema* pra chegar nos benchmarks. DeepSeek-R1? ~23K tokens. Isso é 240x mais compute em inferência. O framing de '4B active' soa eficiente, mas o resultado vem queimando test-time compute que outros modelos não precisam."
#+end_quote

* Fofoca: Mythos vs GPT-5.5 Cyber

#+ATTR_HTML: :style font-size:0.6em;text-align:left;
#+begin_quote
AISI (UK) testou os dois modelos em cybersecurity:

- GPT-5.5: 71.4% (tarefas Expert)
- Mythos Preview: 68.6% (margem de erro se sobrepõe)

Mythos resolveu ataque end-to-end em 3/10 tentativas. GPT-5.5 em 2/10.

O detalhe: Mythos é acesso restrito (11 parceiros). GPT-5.5 é público.
#+end_quote

* Por que Python?

- *Sintaxe simples* → parece pseudocódigo
- *Bibliotecas* → milhões de pacotes prontos
- *Comunidade* → documentação em todo lugar
- *O ecossistema de IA vive em Python* → Gemini, HuggingFace, Anthropic — todos lançam API primeiro em Python

* Variáveis

#+BEGIN_SRC python
nome = "Maria"      # texto (string)
idade = 25          # número inteiro (int)
altura = 1.70       # número decimal (float)
estudante = True    # verdadeiro/falso (bool)

# F-strings
mensagem = f"{nome} tem {idade} anos"
#+END_SRC

* Listas e Dicionários

#+BEGIN_SRC python
# Lista: sequência ordenada
frutas = ["maçã", "banana", "laranja"]
frutas.append("uva")
frutas[0]    # "maçã"
frutas[-1]   # "uva"

# Dicionário: pares chave-valor
pessoa = {"nome": "João", "idade": 30}
pessoa["nome"]           # "João"
pessoa["idade"] = 31     # atualiza
pessoa["cidade"] = "BH"  # adiciona
#+END_SRC

* Funções

#+BEGIN_SRC python
def saudar(nome, saudacao="Olá"):
    return f"{saudacao}, {nome}!"

saudar("Maria")        # "Olá, Maria!"
saudar("João", "Oi")  # "Oi, João!"
#+END_SRC

* Condicionais

#+BEGIN_SRC python
if idade >= 18:
    print("Maior de idade")
elif idade >= 12:
    print("Adolescente")
else:
    print("Criança")
#+END_SRC

* Loops

#+BEGIN_SRC python
# Iterar em lista
for fruta in frutas:
    print(fruta)

# Range
for i in range(5):
    print(i)  # 0, 1, 2, 3, 4

# While
count = 0
while count < 3:
    print(count)
    count += 1
#+END_SRC

* 🔴 Demo: Python no Colab (3 min)

1. Abrir =luksamuk.codes/pages/guilda-ia= → Semana 03

#+begin_quote
Colab abre em modo SOMENTE LEITURA. Faça "Arquivo → Salvar uma cópia no Drive" antes de editar.
#+end_quote

* Para Lembrar

#+begin_quote
"Python é a ferramenta.
O LLM é o cérebro.
A API é a ponte entre eles."
#+end_quote

- *Variáveis, listas, dicts, funções* → base Python
- *JSON* → o formato que APIs entendem
- *Próxima aula* → requisições HTTP, APIs de LLM e chat com memória!

* Perguntas?
:PROPERTIES:
:REVEAL_BACKGROUND: ./slide_03.gif
:END: