slides/03-python-minimo.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Python Mínimo</title>
<meta name="author" content="Lucas S. Vieira"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide" data-background="./slide_03.gif"><p style="font-size:0.7em;opacity:0.6;">Lucas S. Vieira</p><br/><h2>Python Mínimo</h2><br/><p style="font-size:0.85em;opacity:0.8;">O essencial para começar com IA</p><br/><p style="font-size:0.9em;color:#FFB033;">Guilda de IA</p>
</section>
<section>
<section id="slide-org77feaa8">
<h2 id="org77feaa8">📰 Fofocas da Semana</h2>
<ul style="font-size:0.6em;text-align:left;">
<li><b>GPT-5.5 Instant</b> (8/mai) → novo modelo default do ChatGPT, 52% menos alucinação</li>
<li><b>ZAYA1-8B</b> (7/mai) → MoE de 760M params ativos que bate modelos 30x maiores em math/coding</li>
<li><b>Claude Sonnet 4.8 vazado</b> → source do Claude Code expôs 512K linhas e road map interno</li>
<li><b>Mythos vs GPT-5.5 Cyber</b> → AISI testou: GPT-5.5 fez 71.4%, Mythos 68.6% em cyber — empate técnico</li>
<li><b>Mistral Medium 3.5</b> → 128B params, 256K contexto, 77.6% SWE-bench, Apache 2.0</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgb66d8ee">
<h2 id="orgb66d8ee">Fofoca: ZAYA1-8B</h2>
<blockquote style="font-size:0.55em;text-align:left;">
<p>
8.4B total, 760M ativos por token (MoE++).
Apache 2.0. Treinado em AMD MI300x (1024 nós).
</p>

<p>
Mas: arquitetura customizada (CCA + router MLP) → <b>não roda em llama.cpp</b>. Precisa de vLLM/SGLang.
</p>
</blockquote>

<blockquote style="font-size:0.55em;text-align:left;">
<p>
Daniel Lougen (M.S.): "ZAYA1-8B usa até <b>5.5M tokens por problema</b> pra chegar nos benchmarks. DeepSeek-R1? ~23K tokens. Isso é 240x mais compute em inferência. O framing de '4B active' soa eficiente, mas o resultado vem queimando test-time compute que outros modelos não precisam."
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org2549c9a">
<h2 id="org2549c9a">Fofoca: Mythos vs GPT-5.5 Cyber</h2>
<blockquote style="font-size:0.55em;text-align:left;">
<p>
AISI (UK) testou os dois modelos em cybersecurity:
</p>

<ul>
<li>GPT-5.5: 71.4% (tarefas Expert)</li>
<li>Mythos Preview: 68.6% (margem de erro se sobrepõe)</li>

</ul>

<p>
Mythos resolveu ataque end-to-end em 3/10 tentativas. GPT-5.5 em 2/10.
</p>

<p>
O detalhe: Mythos é acesso restrito (11 parceiros). GPT-5.5 é público.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-orgde9d9c0">
<h2 id="orgde9d9c0">Por que Python?</h2>
<ul>
<li><b>Sintaxe simples</b> → parece pseudocódigo</li>
<li><b>Bibliotecas</b> → milhões de pacotes prontos</li>
<li><b>Comunidade</b> → documentação em todo lugar</li>
<li><b>O ecossistema de IA vive em Python</b> → Gemini, HuggingFace, Anthropic — todos lançam API primeiro em Python</li>

</ul>
</section>
</section>
<section>
<section id="slide-org8b67c9c">
<h2 id="org8b67c9c">Variáveis</h2>
<div class="org-src-container">

<pre   ><code class="python" >nome = "Maria"      # texto (string)
idade = 25          # número inteiro (int)
altura = 1.70       # número decimal (float)
estudante = True    # verdadeiro/falso (bool)

# F-strings
mensagem = f"{nome} tem {idade} anos"
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-orgea7e828">
<h2 id="orgea7e828">Listas e Dicionários</h2>
<div class="org-src-container">

<pre   ><code class="python" ># Lista: sequência ordenada
frutas = ["maçã", "banana", "laranja"]
frutas.append("uva")
frutas[0]    # "maçã"
frutas[-1]   # "uva"

# Dicionário: pares chave-valor
pessoa = {"nome": "João", "idade": 30}
pessoa["nome"]           # "João"
pessoa["idade"] = 31     # atualiza
pessoa["cidade"] = "BH"  # adiciona
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org3400028">
<h2 id="org3400028">Funções</h2>
<div class="org-src-container">

<pre   ><code class="python" >def saudar(nome, saudacao="Olá"):
    return f"{saudacao}, {nome}!"

saudar("Maria")        # "Olá, Maria!"
saudar("João", "Oi")  # "Oi, João!"
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org131ce09">
<h2 id="org131ce09">Condicionais</h2>
<div class="org-src-container">

<pre   ><code class="python" >if idade &gt;= 18:
    print("Maior de idade")
elif idade &gt;= 12:
    print("Adolescente")
else:
    print("Criança")
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org87e7c5b">
<h2 id="org87e7c5b">Loops</h2>
<div class="org-src-container">

<pre   ><code class="python" ># Iterar em lista
for fruta in frutas:
    print(fruta)

# Range
for i in range(5):
    print(i)  # 0, 1, 2, 3, 4

# While
count = 0
while count &lt; 3:
    print(count)
    count += 1
</code></pre>
</div>
</section>
</section>
<section>
<section id="slide-org4d7be76">
<h2 id="org4d7be76">🔴 Demo: Python no Colab (3 min)</h2>
<ol>
<li>Abrir <code>luksamuk.codes/pages/guilda-ia</code> → Semana 03</li>

</ol>

<blockquote >
<p>
Colab abre em modo SOMENTE LEITURA. Faça "Arquivo → Salvar uma cópia no Drive" antes de editar.
</p>
</blockquote>
</section>
</section>
<section>
<section id="slide-org07d813e">
<h2 id="org07d813e">Para Lembrar</h2>
<blockquote >
<p>
"Python é a ferramenta.
O LLM é o cérebro.
A API é a ponte entre eles."
</p>
</blockquote>

<ul>
<li><b>Variáveis, listas, dicts, funções</b> → base Python</li>
<li><b>JSON</b> → o formato que APIs entendem</li>
<li><b>Próxima aula</b> → requisições HTTP, APIs de LLM e chat com memória!</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgd3f825a" data-background="./slide_03.gif">
<h2 id="orgd3f825a">Perguntas?</h2>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
